Autodesk.Revit.DB.Visual.Checker.TextureVRepeat
The property labeled "V Repeat" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.TextureURepeat
The property labeled "U Repeat" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.TextureScaleLock
The property labeled "Scale Lock" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.TextureRealWorldScaleY
The property labeled "Size Y" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.TextureRealWorldScaleX
The property labeled "Size X" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.TextureWAngle
The property labeled "Rotation" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 360".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.TextureOffsetLock
The property labeled "Offset Lock" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.TextureRealWorldOffsetX
The property labeled "Offset X" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.TextureLinkTextureTransforms
The property labeled "Link Transforms" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.CheckerSoften
The property labeled "Soften" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 5".
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.CheckerColor2
The property labeled "Color 2" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker.CheckerColor1
The property labeled "Color 1" from the "Checker" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Checker
Represents the properties of materials.
Since:
2018.1